<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e594563c682cdd82e80a59139134acde108d8569a488ef4ede1df93f8eab5421","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1402 at https://github.com/cal-itp/data-infra/actions/runs/21567854303","plan_out_hash":"b1730ccdec86f8789625f8e48d0ecd2452dea6bf8e51def8dd7651a20e93dcc8","plan_hash":"e89ec263e0a0142b234a69250b7df4cfa2e116f11ef9f3b1a2deef9d2a4b67f5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "PRLc0g==" -> (known after apply)
!~      detect_md5hash      = "nVyaajvvbb+K9z8zomV++g==" -> "different hash"
!~      generation          = 1769734707116845 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "nVyaajvvbb+K9z8zomV++g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/fct_payments_rides_enghouse.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ntgSiw==" -> (known after apply)
!~      detect_md5hash      = "LItfT2wE4VvSBwvV3Obndg==" -> "different hash"
!~      generation          = 1769734706508653 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
!~      md5hash             = "LItfT2wE4VvSBwvV3Obndg==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/_seeds.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "e50pyg==" -> (known after apply)
!~      detect_md5hash      = "eDdF0ChmuJ6lUlRN6un4Dg==" -> "different hash"
!~      generation          = 1755275089797226 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/seeds/_seeds.yml"
!~      md5hash             = "eDdF0ChmuJ6lUlRN6un4Dg==" -> (known after apply)
        name                = "data/warehouse/seeds/_seeds.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/payments_entity_mapping_enghouse.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "FbGsog==" -> (known after apply)
!~      detect_md5hash      = "lUDbP9Xe7zDZ3nJyoiG4HA==" -> "different hash"
!~      generation          = 1768255231513606 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/seeds/payments_entity_mapping_enghouse.csv"
!~      md5hash             = "lUDbP9Xe7zDZ3nJyoiG4HA==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping_enghouse.csv"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "y2UYkg==" -> (known after apply)
!~      detect_md5hash      = "lFoJHYQSmT7zpalMreNSRQ==" -> "different hash"
!~      generation          = 1769734708817594 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "lFoJHYQSmT7zpalMreNSRQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1402](https://github.com/cal-itp/data-infra/actions/runs/21567854303)